writingLogTemplateVer5.org
#+Title:Writing log for this hot paper
#+Options: toc:nil author:nil
#+LaTeX_CLASS:article
#+LaTeX_CLASS_OPTIONS:[11pt,letterpaper]
# \documentclass[10pt,letterpaper]{article}
#+LaTeX_HEADER:\usepackage{amsmath}
#+LaTeX_HEADER:\usepackage{amsfonts}
#+LaTeX_HEADER:\usepackage{amssymb}
#+LaTeX_HEADER:\usepackage{makeidx}
#+LaTeX_HEADER:\usepackage{graphicx}
#+LaTeX_HEADER:\usepackage{hyperref}
#+LaTeX_HEADER:\usepackage[letterpaper, total={7in, 9in}]{geometry}
#+LaTeX_HEADER:\usepackage{datetime2}
#+LaTeX_HEADER:\usepackage{minted}
#+LaTeX_HEADER:\usepackage{ulem}
#+LaTeX_HEADER:\usepackage{spreadtab}
# #+LaTeX_HEADER:\usepackage{setspace} \singlespacing
#+LaTeX_HEADER:%Print page numbers in the upper right corner rather than the bottom center.
#+LaTeX_HEADER:\pagestyle{myheadings}
#+LaTeX_HEADER:% Code for plotting table 
#+LaTeX_HEADER:\usepackage{pgfplots}
#+LaTeX_HEADER:\usepackage{pgfplotstable}
#+LaTeX_HEADER:\usepackage{booktabs}
#+LaTeX_HEADER:\usepackage{array}
#+LaTeX_HEADER:\usepackage{colortbl}
#+LaTeX_HEADER:\pgfplotstableset{% global config, for example in the preamble
#+LaTeX_HEADER:  every head row/.style={before row=\toprule,after row=\midrule},
#+LaTeX_HEADER:  every last row/.style={after row=\bottomrule},
#+LaTeX_HEADER:  fixed,precision=2,
#+LaTeX_HEADER:}
#+LaTeX_HEADER:% todolist env from https://tex.stackexchange.com/questions/247681/how-to-create-checkbox-todo-list
#+LaTeX_HEADER:% done with checkmark, wontfix with x, next with finger.
#+LaTeX_HEADER:% Use square brackets around the commands: e.g., [\next]
#+LaTeX_HEADER:\usepackage{enumitem,amssymb}
#+LaTeX_HEADER:\newlist{todolist}{itemize}{2}
#+LaTeX_HEADER:\setlist[todolist]{label=$\square$}
#+LaTeX_HEADER:\usepackage{pifont}
#+LaTeX_HEADER:\newcommand{\nmark}{\ding{42}}% next
#+LaTeX_HEADER:\newcommand{\cmark}{\ding{51}}% checkmark
#+LaTeX_HEADER:\newcommand{\xmark}{\ding{55}}% x-mark
#+LaTeX_HEADER:\newcommand{\wmark}{\ding{116}}% wait mark, inverted triangle representing yield sign
#+LaTeX_HEADER:\newcommand{\done}{\rlap{$\square$}{\raisebox{2pt}{\large\hspace{1pt}\cmark}}%
#+LaTeX_HEADER:  \hspace{-2.5pt}}
#+LaTeX_HEADER:\newcommand{\wontfix}{\rlap{$\square$}{\large\hspace{1pt}\xmark}}
#+LaTeX_HEADER:\newcommand{\waiting}{\rlap{\raisebox{0.18ex}{\hspace{0.17ex}\scriptsize \wmark}}$\square$}
#+LaTeX_HEADER:% \newcommand{\next}{\nmark}%
#+LaTeX_HEADER:\bibliographystyle{cell}
#+Latex_HEADER:\makeindex
#+Latex_HEADER:\title{Writing Log for hot paper}
#+Latex_HEADER:\author{Blaine Mooers}

#+LaTeX:\maketitle


#+LaTeX:\tableofcontents





* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:CLASS: unnumbered
:END:
#+Latex:\index{introduction}

This template contains a table of contents, numbered outline, and an
index that support navigating the document when it has been rendered
into a PDF. The label and ref macros are part of LaTeX's hyperlinking
system. Items in the table of contents and in the index are hyperlinked
to sites in the body of the writing log. When the tex file is being
viewed on Overleaf, the file outline will appear in the left column. You
can navigate to different sections of the document by clicking on the
file outline in this left column.

*Version 0.5* is a massive restructuring from four sections to seven sections
for improved clarity and simplicity. The comments in the sections below
can be commented out with
a good text editor or by inserting a percent sign at the start of each
line. Some of the explanatory text some may have value in the future.
You can always comment out the lines that contain the explanatory text
by inserting a percent sign at the start of each line. In Overleaf, you
would can select the block of text and then enter command-/ to comment
out the block.



* Project initiation
:PROPERTIES:
:CUSTOM_ID: project-initiation
:END:
#+Latex:\index{project initiation}


** Rationale for this article
:PROPERTIES:
:CUSTOM_ID: sub:why
:END:
#+Latex:\index{rationale}


# What is the rationale for writing this paper? To help advance the field?
# To help win or renew a grant funding? To establish credibility in a new
# field for my lab?

** Audience for the paper
:PROPERTIES:
:CUSTOM_ID: sub:audience
:END:
#+Latex:\index{audience for the paper}

# Describe in a paragraph of prose the target audience of this paper.



** Potential target journals for submission
:PROPERTIES:
:CUSTOM_ID: sub:target-journals
:END:
#+Latex:\index{target journals}

# The journal titles are enumerated in descending order of desirability.
# You have a plan B journal identified at the time of submission so that
# you can respond swiftly if the plan A journal rejects the paper.

1. 
2. 
3. 
4. 




** Related projects
:PROPERTIES:
:CUSTOM_ID: sub:related-projects
:END:
#+Latex:\index{related projects}


# By listing projects that are closely and even somewhat distantly related
# to the project at hand, it is possible to identify some synergies that
# might otherwise be overlooked. For example, when working in a new area,
# it is often useful to capitalize on the investment made in reading in
# the new field by capturing those insights in the form of a review
# article or book chapter. If you use Overleaf, you can include a
# hyperlink to the project's webpage.

- 
- 
- 
- 

** Draft Introduction
:PROPERTIES:
:CUSTOM_ID: subsec:Introduction
:END:
#+Latex:\index{draft!introduction}


# In this section and in the next two sections, we assemble the key
# components of the paper. You may wonder why we did not do this in the
# manuscript document. We find it easier to keep this prose close to the
# other lists in the sections that follow these subsections. In other
# words, we are using the writing log as an incubator for the initial
# drafts of these components of the paper.

# We craft a two-paragraph introduction following the method of Lindsay
# (Lindsay 2020 Scientific Writing Thinking In Words 2nd Ed). We do this
# drafting in the writing log until we are satisfied that we have a vision
# of the project that is clear enough to proceed. At this point, we
# transfer the draft introduction to the main manuscript.



** Potential results
:PROPERTIES:
:CUSTOM_ID: subsec:Results.
:END:
#+Latex:\index{draft!results}


# This section contains a list of the potential key results that are vital
# to addressing the central hypothesis. Usually, there are 4 to 6 key
# results. Yes, we can think about the nature of the results even before
# we have performed the experiments.

# We are not necessarily thinking about the expected results, but we can
# guess about the nature of the results with regard to whether they will
# be in the form of a table, a graph or an image. We then do an initial
# sorting of the results on the basis of how much weight they bear upon
# testing the central hypothesis. This sorting will be the order in which
# the results are presented, in contrast to the general tendency to
# deliver the results in the order in which we obtain the results. At this
# point, we might even draft an initial paragraph for the results section
# that outlines the order of the results. This initial paragraph helps to
# set the reader's expectations about the results that follow. After this
# initial paragraph is assembled and the planned results are listed, we
# will transfer this text to the main manuscript.

1. 
2. 
3. 
4. 
5. 
6. 

** Potential discussion points
:PROPERTIES:
:CUSTOM_ID: subsec:futureDiscussion
:END:
#+Latex:\index{draft!discussion}

# After some years of experience in a particular field, one has a sense of
# the critical discussion points about how the proposed results will
# relate to the results from the work of others. The content of this
# discussion is supposed to be about the relationship of our results to
# those reported by others. Sometimes, we expand these discussion points
# into initial paragraphs. After we think this section is well-developed,
# we will transfer it to the main manuscript.



** Prior discussion points
:PROPERTIES:
:CUSTOM_ID: subsec:priorDiscussion
:END:
#+Latex:\index{draft!prior discussion points}

# The discussion section should contain new points of discussion. If you
# are writing a series of papers about a topic, it is all too easy to
# recycle old discussion points. Before making the transfer mentioned
# above, we will check the proposed discussion points against those we
# have published to avoid repeating ourselves and remind ourselves to
# review our new results against our prior discussion points. You can
# check this list against the discussion section of your current
# manuscript to ensure that you are raising new points or updating prior
# points while appropriately citing yourself. The new results may require
# that we update our published discussion points.

1. 
2. 
3. 
4.
5.
6.
7.

** Potential titles
:PROPERTIES:
:CUSTOM_ID: sub:titles
:END:
#+Latex:\index{darft!potenital titles}

# Titles of 3-7 words long are easier for people to remember. We generally
# iterate through enough titles to find one that is catchy. Sometimes,
# this requires generating a list of more than 100 titles. This work takes
# time and should not be delayed until the day of manuscript submission.

1. 
2. 
3. 
4.
5.
6.
7.




** Potential Keywords
:PROPERTIES:
:CUSTOM_ID: sub:keywords
:CLASS: unnumbered
:END:
#+Latex:\index{darft!potenital keywords}

# Below is a list of potential keywords. Abstracting services use the
# title and abstract to extract terms for searching. As a result, select
# keywords that are not in these two parts of the paper. Usually, there is
# a limit on the number of keywords, so we choose the keywords carefully.
# We make a long list of keywords and select the best ones.


1. open science
2. 
3.
4.
5.
6.
7.



** Potential Abstract
:PROPERTIES:
:CUSTOM_ID: potential-abstract
:CLASS: unnumbered
:END:
#+Latex:\index{draft!potential abstract}

# After filling in the above subsections, we are in a solid position to
# draft the abstract for the paper. This is just a draft and will be
# updated as the results emerge. However, going through this exercise is
# another way of visualizing the paper's contents and helps to strengthen
# that vision. Such clarity is essential to maintain momentum.


