writingLogTemplateVer5.tex
% Created 2024-08-11 Sun 20:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{amssymb}
\usepackage{makeidx}
\usepackage{graphicx}
\usepackage{hyperref}
\usepackage[letterpaper, total={7in, 9in}]{geometry}
\usepackage{datetime2}
\usepackage{minted}
\usepackage{ulem}
\usepackage{spreadtab}
%Print page numbers in the upper right corner rather than the bottom center.
\pagestyle{myheadings}
% Code for plotting table
\usepackage{pgfplots}
\usepackage{pgfplotstable}
\usepackage{booktabs}
\usepackage{array}
\usepackage{colortbl}
\pgfplotstableset{% global config, for example in the preamble
every head row/.style={before row=\toprule,after row=\midrule},
every last row/.style={after row=\bottomrule},
fixed,precision=2,
}
% todolist env from https://tex.stackexchange.com/questions/247681/how-to-create-checkbox-todo-list
% done with checkmark, wontfix with x, next with finger.
% Use square brackets around the commands: e.g., [\next]
\usepackage{enumitem,amssymb}
\newlist{todolist}{itemize}{2}
\setlist[todolist]{label=$\square$}
\usepackage{pifont}
\newcommand{\nmark}{\ding{42}}% next
\newcommand{\cmark}{\ding{51}}% checkmark
\newcommand{\xmark}{\ding{55}}% x-mark
\newcommand{\wmark}{\ding{116}}% wait mark, inverted triangle representing yield sign
\newcommand{\done}{\rlap{$\square$}{\raisebox{2pt}{\large\hspace{1pt}\cmark}}%
\hspace{-2.5pt}}
\newcommand{\wontfix}{\rlap{$\square$}{\large\hspace{1pt}\xmark}}
\newcommand{\waiting}{\rlap{\raisebox{0.18ex}{\hspace{0.17ex}\scriptsize \wmark}}$\square$}
% \newcommand{\next}{\nmark}%
\bibliographystyle{cell}
\makeindex
\title{Writing Log for hot paper}
\author{Blaine Mooers}
\date{\today}
\title{Writing log for this hot paper}
\hypersetup{
 pdfauthor={Blaine Mooers},
 pdftitle={Writing log for this hot paper},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\maketitle


\tableofcontents





\section{Introduction}
\label{sec:orgb8bc424}
\index{introduction}

This template contains a table of contents, numbered outline, and an
index that support navigating the document when it has been rendered
into a PDF. The label and ref macros are part of LaTeX's hyperlinking
system. Items in the table of contents and in the index are hyperlinked
to sites in the body of the writing log. When the tex file is being
viewed on Overleaf, the file outline will appear in the left column. You
can navigate to different sections of the document by clicking on the
file outline in this left column.

\textbf{Version 0.5} is a massive restructuring from four sections to seven sections
for improved clarity and simplicity. The comments in the sections below
can be commented out with
a good text editor or by inserting a percent sign at the start of each
line. Some of the explanatory text some may have value in the future.
You can always comment out the lines that contain the explanatory text
by inserting a percent sign at the start of each line. In Overleaf, you
would can select the block of text and then enter command-/ to comment
out the block.



\section{Project initiation}
\label{sec:org70645d4}
\index{project initiation}


\subsection{Rationale for this article}
\label{sec:org725d5bf}
\index{rationale}

\subsection{Audience for the paper}
\label{sec:org0c20679}
\index{audience for the paper}



\subsection{Potential target journals for submission}
\label{sec:org3213b54}
\index{target journals}

\begin{enumerate}
\item 

\item 

\item 

\item 
\end{enumerate}




\subsection{Related projects}
\label{sec:orgb8ff194}
\index{related projects}


\begin{itemize}
\item 

\item 

\item 

\item 
\end{itemize}

\subsection{Draft Introduction}
\label{sec:org1ff72e5}
\index{draft!introduction}



\subsection{Potential results}
\label{sec:orgba34895}
\index{draft!results}


\begin{enumerate}
\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}

\subsection{Potential discussion points}
\label{sec:org8ed31ea}
\index{draft!discussion}



\subsection{Prior discussion points}
\label{sec:orgb896e3b}
\index{draft!prior discussion points}

\begin{enumerate}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}

\subsection{Potential titles}
\label{sec:org5ee1b74}
\index{darft!potenital titles}

\begin{enumerate}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}




\subsection{Potential Keywords}
\label{sec:org9e68ebf}
\index{darft!potenital keywords}


\begin{enumerate}
\item open science
\item 

\item 

\item 

\item 

\item 

\item 
\end{enumerate}



\subsection{Potential Abstract}
\label{sec:org150ba8d}
\index{draft!potential abstract}
