writingLogTemplateVer5.org
** Abbreviations
:PROPERTIES:
:CUSTOM_ID: sub:abbrev
:END:
#+Latex:\index{draft!abbreviations}

# A common mistake is to delay the assembly of the list of acronyms and
# abbreviations. An incomplete list tells the reviewer that the authors
# assembled the manuscript in a hurry.


#+begin_quote
Acronyms/Abbreviations/Initialisms should be defined the first time they
appear in each of three sections: the abstract; the main text; the first
figure or table. When defined for the first time, the
acronym/abbreviation/initialism should be added in parentheses after the
written-out form.
#+end_quote

Abbreviations are also listed at the end of the manuscript.

- abbrev :: its expansion

- abbrev :: its expansion

- abbrev :: its expansion

- abbrev :: its expansion


** Potential collaborators: name; institution;e-mail
:PROPERTIES:
:CUSTOM_ID: sub:collaborators
:END:
#+Latex:\index{draft!collaborators}


-
-
- 
- 

** Potential competitors: name; institution;e-mail
:PROPERTIES:
:CUSTOM_ID: sub:competitors
:END:
#+Latex:\index{draft!competitors}


- 
- 

** Potential reviewers: name; institution; e-mail
:PROPERTIES:
:CUSTOM_ID: sub:reviewers
:END:
#+Latex:\index{draft!potential reviewers}


1. 
2.
3.
4.
5.   

** Draft cover letter
:PROPERTIES:
:CUSTOM_ID: sub:coverletter
:END:
#+Latex:\index{draft!cover letter}

# It is never too early to start writing the cover letter for a project.
# This letter is another form of summary that is part of the actualization
# of the project. If we have enough energy and time left over from
# completing the initialization of the writing project, we may proceed to
# drafting the cover letter. The advantage of doing so is to capture one's
# excitement about the project.



** Acknowledgements
:PROPERTIES:
:CUSTOM_ID: subsec:literaturesources
:END:
#+Latex:\index{draft!acknowledgements}

# It is never too early to start this section.
# Work on it should not be delayed until the last minute because you risk overlooking somebody's contribution.


-
-
-
-
-
-

** Funding sources
:PROPERTIES:
:CUSTOM_ID: subsec:fundingsources
:END:
#+Latex:\index{data!funding sources}

# It is never too early to start this section.
# Work on it should not be delayed until the last minute because you risk overlooking a funding source.
 
-
-
-
-
-
-
-
-
-


* Data
:PROPERTIES:
:CUSTOM_ID: sec:data
:END:
#+LaTeX:\index{data}

This section catalogs the data to be used in the paper.



** Inventory of data on hand
:PROPERTIES:
:CUSTOM_ID: subsec:datainventory
:END:
#+LaTeX:\index{data inventory!data on hand}


#+CAPTION[Stored data]: Projects's stored data. 
| Description               | Location   |
|---------------------------+------------|
| SSRL images February 2024 | MooersHD11 |
| SSRL images August 2024   | MooersHD12 |



** Inventory of project's required external software
:PROPERTIES:
:CUSTOM_ID: subsec:externalsoftware
:END:
#+LaTeX:\index{data inventory!external software}


#+CAPTION[External software]: Projects's required external software.
| Description               | Location   |
|---------------------------+------------|
| CCP4                      | iMac2      |
| Phenix                    | iMac3      |



** Inventory of project's software repositories
:PROPERTIES:
:CUSTOM_ID: subsec:projectsrepos
:END:
#+LaTeX:\index{data inventory!sofware repos}


#+CAPTION[Software repos]: Projects's software repositories. 
| Description               | Location   |
|---------------------------+------------|
| Repo1                     |GitHub      |
| Repo2                     |Codeberg    |



** Relevant videos
:PROPERTIES:
:CUSTOM_ID: subsec:videos
:END:
#+Latex:\index{data inventory!videos}

#+CAPTION[Related videos]: Videos related to project. 
| Description | URL |
|-------------+-----|
|             |     |
|             |     |


** Relevant blogs
:PROPERTIES:
:CUSTOM_ID: subsec:videos
:END:
#+Latex:\index{data inventory!relevent blogs}
-
-
-
-
-
-


** Relevant literature sources
:PROPERTIES:
:CUSTOM_ID: subsec:literaturesources
:END:
#+Latex:\index{data inventory!literature sources}

-
-
-
-
-
-

** Relevant collections of PDFs in Research Rabbit and the like
:PROPERTIES:
:CUSTOM_ID: subsec:pdfs
:END:
#+Latex:\index{data!collections of PDFs}


-
-
-
-
-
-


** Project's progress summary for annual grant report 
:PROPERTIES:
:CUSTOM_ID: subsec:annualgrantreport
:END:

#+Latex:\index{annual grant report}
# It is never too early to start this section.

-
-
-
-
-
-
-



** Project's progress summary for annual report to college
:PROPERTIES:
:CUSTOM_ID: subsec:annualcollegereport
:END:
#+Latex:\index{data!annual college report}

# It is never too early to start this section.
# This will be where you inform your superiors what you have been up to.

-
-
-
-
-
-
-



* Plans to support the writing project
:PROPERTIES:
:CUSTOM_ID: supportforwritingproject
:END:
#+Latex:\index{plans!support for the writing project}

# While it is useful to write about half of a manuscript in four hours in the first sitting without having done any experiments to provide a mental framework for the project and limit the scope, the work will need to be done.
# If the work is computational or experimental, many plans exist to get it done. 
# Several plans must be developed to execute the work required to complete and submit the manuscript.
# These plans might not be written down many times, but it is probably quite useful to actually articulate them somewhere.
# These plans may not necessarily have to reside inside the writing log: A link to the plan in a plain text or an HTML file may be sufficient.
#+Latex:% Some of these plans are global in nature and may be applicable across all projects.
#+Latex:% Some plans may be specific to the project at hand and must be elaborated on.
#+Latex:% If these plans are relatively short, they could be included in the writing log, but if they are lengthy, it might be necessary to just provide a link to them.



- Budget
- Relation to specific aims of funded grants.
- Secure funding for the research and manuscript.
- Timeline to do the required experiments to test the hypothesis. 
- Secure access to required national laboratory resources at experimental stations (i.e., general user proposal and beamtime requests).
- Secure access to computing resources.
- Gather the appropriate information from the literature.
- Recruit collaborators
- Recruit lab members to do the work.
- Individual career development for lab members, including yourself.
- Biosafety.
- Authentication of key biological and chemical resources.
- Rigorous statistical sampling and data analysis
- Data management including backups and archives.
- Data sharing.
- The NIH PEDP.
- Advertising plan: posters, talks, seminars, YouTube videos, social media posts.




** Timeline for experiments
:PROPERTIES:
:CUSTOM_ID: subsec:supportforwritingproject
:END:
#+Latex:\index{plans!timeline for experiments}


** User proposals: national labs
:PROPERTIES:
:CUSTOM_ID: subsec:userproposals
:END:
#+Latex:\index{plans!user proposals for national labs}


** User proposals: HPC
:PROPERTIES:
:CUSTOM_ID: subsec:hpcproposals
:END:
#+Latex:\index{plans!user proposals for high performance computing}



** Literature retrieval
:PROPERTIES:
:CUSTOM_ID: subsec:literatureretrieval
:END:
#+Latex:\index{plans!literature retrieval}




** Funding
:PROPERTIES:
:CUSTOM_ID: subsec:funding
:END:
#+Latex:\index{plans!funding}



** Recruitment of collaborators
:PROPERTIES:
:CUSTOM_ID: subsec:collaborators
:END:
#+Latex:\index{plans!collaborators}



** Recruitment of workers
:PROPERTIES:
:CUSTOM_ID: subsec:workers
:END:
#+Latex:\index{plans!recruitment of workers}



** Career development plans
:PROPERTIES:
:CUSTOM_ID: subsec:carreerdevelopment
:END:
#+Latex:\index{plans!carreer development}



** Biosafety
:PROPERTIES:
:CUSTOM_ID: subsec:biosafety
:END:
#+Latex:\index{plans!biosafety}




** Authentication of key biological resources
:PROPERTIES:
:CUSTOM_ID: subsec:authenticationbiological
:END:
#+Latex:\index{plans!authentication!biological resources}


** Authentication of chemical resources
:PROPERTIES:
:CUSTOM_ID: subsec:authenticationchemicalresources
:END:
#+Latex:\index{plans!authenticiation!chemical resources}


** Statistical sampling and power analysis
:PROPERTIES:
:CUSTOM_ID: subsec:samplingpoweranalysis
:END:
#+Latex:\index{plans!sampling plan}
#+Latex:\index{plans!power analysis}



** Computer simulations
:PROPERTIES:
:CUSTOM_ID: subsec:simulation
:END:
#+Latex:\index{plans!simulation}


** Data analysis plans
:PROPERTIES:
:CUSTOM_ID: subsec:analysisplans
:END:
#+Latex:\index{plans!analysis}




** Data management plans
:PROPERTIES:
:CUSTOM_ID: subsec:datamanagementplans
:END:
#+Latex:\index{plans!data management}




** Data sharing plans
:PROPERTIES:
:CUSTOM_ID: subsec:datasharingplans
:END:
#+Latex:\index{plans!data sharing}




** The NIH PEDP
:PROPERTIES:
:CUSTOM_ID: subsec:pedp
:END:
#+Latex:\index{plans!NIH PEDP}


