writingLogTemplateVer5.tex


\subsection{Abbreviations}
\label{sec:org913e826}
\index{draft!abbreviations}


\begin{quote}
Acronyms/Abbreviations/Initialisms should be defined the first time they
appear in each of three sections: the abstract; the main text; the first
figure or table. When defined for the first time, the
acronym/abbreviation/initialism should be added in parentheses after the
written-out form.
\end{quote}

Abbreviations are also listed at the end of the manuscript.

\begin{description}
\item[{abbrev}] its expansion

\item[{abbrev}] its expansion

\item[{abbrev}] its expansion

\item[{abbrev}] its expansion
\end{description}


\subsection{Potential collaborators: name; institution;e-mail}
\label{sec:orge6a433e}
\index{draft!collaborators}


\begin{itemize}
\item 

\item 

\item 

\item 
\end{itemize}

\subsection{Potential competitors: name; institution;e-mail}
\label{sec:org28c9604}
\index{draft!competitors}


\begin{itemize}
\item 

\item 
\end{itemize}

\subsection{Potential reviewers: name; institution; e-mail}
\label{sec:orgaf6e027}
\index{draft!potential reviewers}


\begin{enumerate}
\item 

\item 

\item 

\item 

\item 
\end{enumerate}

\subsection{Draft cover letter}
\label{sec:orgf22027a}
\index{draft!cover letter}



\subsection{Acknowledgements}
\label{sec:org5ebeedd}
\index{draft!acknowledgements}


\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}

\subsection{Funding sources}
\label{sec:orgbb2e216}
\index{data!funding sources}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}


\section{Data}
\label{sec:org0693ff0}
\index{data}

This section catalogs the data to be used in the paper.



\subsection{Inventory of data on hand}
\label{sec:org74d0ab8}
\index{data inventory!data on hand}


\begin{table}[htbp]
\caption[Stored data]{Projects's stored data.}
\centering
\begin{tabular}{ll}
Description & Location\\[0pt]
\hline
SSRL images February 2024 & MooersHD11\\[0pt]
SSRL images August 2024 & MooersHD12\\[0pt]
\end{tabular}
\end{table}



\subsection{Inventory of project's required external software}
\label{sec:org8ca4a28}
\index{data inventory!external software}


\begin{table}[htbp]
\caption[External software]{Projects's required external software.}
\centering
\begin{tabular}{ll}
Description & Location\\[0pt]
\hline
CCP4 & iMac2\\[0pt]
Phenix & iMac3\\[0pt]
\end{tabular}
\end{table}



\subsection{Inventory of project's software repositories}
\label{sec:org351d456}
\index{data inventory!sofware repos}


\begin{table}[htbp]
\caption[Software repos]{Projects's software repositories.}
\centering
\begin{tabular}{ll}
Description & Location\\[0pt]
\hline
Repo1 & GitHub\\[0pt]
Repo2 & Codeberg\\[0pt]
\end{tabular}
\end{table}



\subsection{Relevant videos}
\label{sec:org6b1444e}
\index{data inventory!videos}

\begin{table}[htbp]
\caption[Related videos]{Videos related to project.}
\centering
\begin{tabular}{ll}
Description & URL\\[0pt]
\hline
 & \\[0pt]
 & \\[0pt]
\end{tabular}
\end{table}


\subsection{Relevant blogs}
\label{sec:org8fe52bf}
\index{data inventory!relevent blogs}
\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}


\subsection{Relevant literature sources}
\label{sec:org4a266d7}
\index{data inventory!literature sources}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}

\subsection{Relevant collections of PDFs in Research Rabbit and the like}
\label{sec:org8197e5e}
\index{data!collections of PDFs}


\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}


\subsection{Project's progress summary for annual grant report}
\label{sec:org43dbeda}
\index{annual grant report}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}



\subsection{Project's progress summary for annual report to college}
\label{sec:orgc1a7989}
\index{data!annual college report}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}



\section{Plans to support the writing project}
\label{sec:org84136fb}
\index{plans!support for the writing project}

% Some of these plans are global in nature and may be applicable across all projects.
% Some plans may be specific to the project at hand and must be elaborated on.
% If these plans are relatively short, they could be included in the writing log, but if they are lengthy, it might be necessary to just provide a link to them.



\begin{itemize}
\item Budget
\item Relation to specific aims of funded grants.
\item Secure funding for the research and manuscript.
\item Timeline to do the required experiments to test the hypothesis.
\item Secure access to required national laboratory resources at experimental stations (i.e., general user proposal and beamtime requests).
\item Secure access to computing resources.
\item Gather the appropriate information from the literature.
\item Recruit collaborators
\item Recruit lab members to do the work.
\item Individual career development for lab members, including yourself.
\item Biosafety.
\item Authentication of key biological and chemical resources.
\item Rigorous statistical sampling and data analysis
\item Data management including backups and archives.
\item Data sharing.
\item The NIH PEDP.
\item Advertising plan: posters, talks, seminars, YouTube videos, social media posts.
\end{itemize}




\subsection{Timeline for experiments}
\label{sec:org75779f0}
\index{plans!timeline for experiments}


\subsection{User proposals: national labs}
\label{sec:orgdf78bb7}
\index{plans!user proposals for national labs}


\subsection{User proposals: HPC}
\label{sec:org8a101cb}
\index{plans!user proposals for high performance computing}



\subsection{Literature retrieval}
\label{sec:org9dd7574}
\index{plans!literature retrieval}




\subsection{Funding}
\label{sec:org2a91aaf}
\index{plans!funding}



\subsection{Recruitment of collaborators}
\label{sec:org4879478}
\index{plans!collaborators}



\subsection{Recruitment of workers}
\label{sec:orgdf5219a}
\index{plans!recruitment of workers}



\subsection{Career development plans}
\label{sec:org876fb2b}
\index{plans!carreer development}



\subsection{Biosafety}
\label{sec:org7d22fb7}
\index{plans!biosafety}




\subsection{Authentication of key biological resources}
\label{sec:org792fad1}
\index{plans!authentication!biological resources}


\subsection{Authentication of chemical resources}
\label{sec:org91a5218}
\index{plans!authenticiation!chemical resources}


\subsection{Statistical sampling and power analysis}
\label{sec:org3857b61}
\index{plans!sampling plan}
\index{plans!power analysis}



\subsection{Computer simulations}
\label{sec:orgfae6842}
\index{plans!simulation}


\subsection{Data analysis plans}
\label{sec:org63b4ae0}
\index{plans!analysis}




\subsection{Data management plans}
\label{sec:org4c1c112}
\index{plans!data management}




\subsection{Data sharing plans}
\label{sec:orga16f971}
\index{plans!data sharing}
