writingLogTemplateVer5.org
* Project management for timely completion 
:PROPERTIES:
:CUSTOM_ID: sec:timelycompletion
:END:
#+Latex:\index{plans!timely completion}

# This section is to plan the completion of the manuscript and for making periodic assessments of its status.
# Having the checklist and the timeline adjacent each other will aid the scheduling of remaining tasks.
# The assessment of the current state could be included within the diary section, but we think it is more useful to include it in this area near the timeline and the checklist for completion. 
#  By having the assessments adjacent to each other, you should be able to see more clearly how progress is being made on the manuscript.



- Checklist for manuscript completion.
- Timeline and Milestones.
- Periodic assessments of the current state of the manuscript.
-
-
-

** Checklist for manuscript completion
:PROPERTIES:
:CUSTOM_ID: subsec:checklist
:END:
#+Latex:\index{manuscript completion!checklist}


- [ ] Central hypothesis identified.
- [ ] Introduction drafted to define scope.
- [ ] Results ordered by relevance to the central hypothesis.
- [ ] Results imagined as figures and tables.
- [ ] Results outlined to the subsection level.
- [ ] Results outlined to the paragraph level.
- [ ] Figures have been conceptualized.
- [ ] Figures have been drafted.
- [ ] Figure legends have been drafted.
- [ ] Tables have been conceptualized.
- [ ] Tables have been drafted.
- [ ] Table legends have been drafted.
- [ ] Paragraphs in the Results section drafted.
- [ ] Results concluding sentences checked.
- [ ] Discussion points identified.
- [ ] Prior publications checked for Discussion points.
- [ ] Discussion paragraphs drafted.
- [ ] Discussion concluding sentences checked.
- [ ] Discussion subsections check with the central hypothesis.
- [ ] Citations have been entered.
- [ ] Citations have been checked.
- [ ] Bibliographic information has been checked.
- [ ] Accuracy of Bibliographic information checked.
- [ ] Citations have entries in the annotated bibliography.
- [ ] Abstract drafted. 
- [ ] Supplemental materials assembled.
- [ ] The first draft is finished.
- [ ] Round 1 of rewriting finished.
- [ ] Round 2 of rewriting finished.
- [ ] Ready for reverse outline.
- [ ] Round 3 of rewriting.
- [ ] Solicit review by co-authors.
- [ ] Internal polishing editing.
- [ ] Ready for intense review by a professional writer.
- [ ] Intensive review revisions have been incorporated.
- [ ] Penultimate draft ready for internal proofreader.
- [ ] Penultimate review revisions incorporated.
- [ ] Manuscript ready for submission.




** Timeline with milestones
:PROPERTIES:
:CUSTOM_ID: subsec:timelinemilestones
:END:
#+Latex:\index{manuscript completion!milestones}

# This is the planning section where the calendar is matched up with milestones: goals without deadlines are just dreams.
# This is a tricky section to include inside of a writing log document because it often requires a heavy-duty external Library to be able to generate an image.
# This could be done by simply copying the checklist and pasting it into this section as a table with three columns: milestone, target date, and achievement date.
# This would lead to a very long table that might be too cluttered.
# There might be a subset of the items in the checklist that are larger in scope that could be listed.
# For example, completion of various parts of the writing log, key experiments, and solicitation of outside expertise.
# The setting up of the time timeline will be very Project Specific and will require customization.
# The main thing is to keep it simple enough to be useful but no simpler than necessary.



#+CAPTION[Milestones]: Timeline with milestones. 
| Milestone   | Target date | Achievement date |
|-------------+-------------+------------------|
|milestone 1  | date        | date             |
|milestone 2  | date        | date             |
|milestone 3  | date        | date             |
|milestone 4  | date        | date             |
|milestone 5  | date        | date             |



** Assessments of current state
:PROPERTIES:
:CUSTOM_ID: subsec:currentstate
:END:
#+Latex:\index{manuscript completion!current state}



*** Date:
:PROPERTIES:
:CUSTOM_ID: ssubsec:date
:END:
#+Latex:\index{manuscript completion!by date}



**** How far is the manuscript from being completed (in percent completion)?
:PROPERTIES:
:CUSTOM_ID: sssubsec:precentcompletion
:END:
#+Latex:\index{manuscript completion!percent completion}





**** List what keeps the manuscript from being submitted today.
:PROPERTIES:
:CUSTOM_ID: sssubsec:holdingback
:END:
#+Latex:\index{manuscript completion!holding back}





**** List what is missing from the manuscript that could improve its impact.
:PROPERTIES:
:CUSTOM_ID: sssubsec:missing
:END:
#+Latex:\index{manuscript completion!what is missing}






**** What could be removed from the manuscript to streamline it?
:PROPERTIES:
:CUSTOM_ID: ssubsec:streamlining
:END:
#+Latex:\index{manuscript completion!streamlining}








* Daily entries
:PROPERTIES:
:CUSTOM_ID: sec:dailyEntries
:END:
#+Latex:\index{daily entries}


** Daily protocol
:PROPERTIES:
:CUSTOM_ID: sub:entry-protocol
:END:
#+Latex:\index{daily protocol}


1. At start of work session, review the timeline
   [[#subsec:benchmarks][2.5]], recent daily entries
   [[#sub:daily-log][2.2]], next action item [[#subsec:next][2.6]], and
   to-do list [[#subsec:to-do][2.7]].
2. Write the goal(s) for the current writing session as a means of
   engaging mentally in the work. This prose could be retained or
   deleted at the end of the work session.
3. At the end of the work session, move finished items to an achievement
   list for the day.
4. Move the unfinished items to the to-do list [[#subsec:to-do][2.7]].
5. Identify the next task or action [[#subsec:next][2.6]].
6. Update the wordcount.txt file, if you wrote anything
   [[#subsec:zk]].
7. Update the project Sheet in the Writing Progress Workbook
   [[#subsec:WPsheet][2.3]].
8. Update your personal knowledge base [[#subsec:zk][2.4]].

** Daily Log
:PROPERTIES:
:CUSTOM_ID: sub:daily-log
:END:
#+Latex:\index{daily log}



*** 2024 August 10
:PROPERTIES:
:CUSTOM_ID: january-21
:END:
#+Latex:\index{2024 August 10}

Accomplishments:

- 
- 
- 

** Update Writing Progress Notebook
:PROPERTIES:
:CUSTOM_ID: subsec:WPsheet
:END:
#+LaTeX:\index{writing progress notebook}

# The writing progress notebook enables the tracking of progress on a
# project basis [fn:1]. The Notebook automatically updates sums of words
# written and minutes spent across all projects on a given day. It only
# takes a few seconds to enter the number of words written and the time
# spent for a specific project on that project's Google Sheet. If you have
# Voice In plus activated, say the words "open sheet 37" to have the
# worksheet for project 37 opened in the web browser. If not, click on
# this direct link to the Google Sheet in the compiled PDF of this writing
# log [fn:2].

# Update the sheet for this project with the total number of minutes spent
# on this project and the word count. The word count is accessed in
# Overleaf under the menu pull-down. The word count operation has to be
# applied to a recently compiled tex document.


** Update Zettelkästen in org-roam
:PROPERTIES:
:CUSTOM_ID: subsec:zk
:END:
#+LaTeX:\index{zettelkasten}

# Update your knowledge base if you found anything worth adding to it. See
# section 4 for guidance ([[#subsec:guides:knowledgebase][4.7]]).


** Timeline or Benchmarks
:PROPERTIES:
:CUSTOM_ID: subsec:benchmarks
:END:
#+LaTeX:\index{timeline}
#+LaTeX:\index{benchmarks}

# This section is an outline of benchmarks or deadlines. I include the
# deadline dates in square brackets. It is best to try to map out a
# timeline so that the project can continue to move forward.


** Next action
:PROPERTIES:
:CUSTOM_ID: subsec:next
:END:
#+LaTeX:\index{next action}

# List the next task or action to be taken to move the project forward.
# The section is supposed to contain one to do item. It is the next task
# that needs to be done. The idea to determine in at the end of the
# current work session what the next action should be so that you do not
# have to spend time selecting the next action item when you return to the
# project. This idea came from David Allen, the author of "Getting things
# done".

# I have to admit that I rarely do this task next. I generally reconsider
# all of the pending to-do's at the start of my work session, and I often
# wind up identifying a new task that was not identified as the "Next
# Action" at the end of the last work session. Anyways, you do gain the
# peace of mind knowing that you have identified the next step, although
# you may not take it. If you do not use this section, go ahead and delete
# it.


** To be done
:PROPERTIES:
:CUSTOM_ID: subsec:to-do
:END:
#+LaTeX:\index{To be done}

# These are the tasks that are thought to be required to get the project
# finished. The prioritizing of the tasks is the hard part. The book "Time
# Power" by Charles Hobbs provides helpful guidance on setting priorities.
# I use an unordered list below but you can use a list of TODO items and 
# include this org file in the list of source files for the generation of 
# TODOs in org agenda. I generally would have an overwhelming number of
# TODOs so I do not use org-agenda in this fashion.

-
-
- 
- 
- 
- 

