writingLogTemplateVer5.tex




\subsection{The NIH PEDP}
\label{sec:org89f8021}
\index{plans!NIH PEDP}


\section{Project management for timely completion}
\label{sec:orga87bf12}
\index{plans!timely completion}



\begin{itemize}
\item Checklist for manuscript completion.
\item Timeline and Milestones.
\item Periodic assessments of the current state of the manuscript.
\item 

\item 

\item 
\end{itemize}

\subsection{Checklist for manuscript completion}
\label{sec:orgc158535}
\index{manuscript completion!checklist}


\begin{itemize}
\item[{$\square$}] Central hypothesis identified.
\item[{$\square$}] Introduction drafted to define scope.
\item[{$\square$}] Results ordered by relevance to the central hypothesis.
\item[{$\square$}] Results imagined as figures and tables.
\item[{$\square$}] Results outlined to the subsection level.
\item[{$\square$}] Results outlined to the paragraph level.
\item[{$\square$}] Figures have been conceptualized.
\item[{$\square$}] Figures have been drafted.
\item[{$\square$}] Figure legends have been drafted.
\item[{$\square$}] Tables have been conceptualized.
\item[{$\square$}] Tables have been drafted.
\item[{$\square$}] Table legends have been drafted.
\item[{$\square$}] Paragraphs in the Results section drafted.
\item[{$\square$}] Results concluding sentences checked.
\item[{$\square$}] Discussion points identified.
\item[{$\square$}] Prior publications checked for Discussion points.
\item[{$\square$}] Discussion paragraphs drafted.
\item[{$\square$}] Discussion concluding sentences checked.
\item[{$\square$}] Discussion subsections check with the central hypothesis.
\item[{$\square$}] Citations have been entered.
\item[{$\square$}] Citations have been checked.
\item[{$\square$}] Bibliographic information has been checked.
\item[{$\square$}] Accuracy of Bibliographic information checked.
\item[{$\square$}] Citations have entries in the annotated bibliography.
\item[{$\square$}] Abstract drafted.
\item[{$\square$}] Supplemental materials assembled.
\item[{$\square$}] The first draft is finished.
\item[{$\square$}] Round 1 of rewriting finished.
\item[{$\square$}] Round 2 of rewriting finished.
\item[{$\square$}] Ready for reverse outline.
\item[{$\square$}] Round 3 of rewriting.
\item[{$\square$}] Solicit review by co-authors.
\item[{$\square$}] Internal polishing editing.
\item[{$\square$}] Ready for intense review by a professional writer.
\item[{$\square$}] Intensive review revisions have been incorporated.
\item[{$\square$}] Penultimate draft ready for internal proofreader.
\item[{$\square$}] Penultimate review revisions incorporated.
\item[{$\square$}] Manuscript ready for submission.
\end{itemize}




\subsection{Timeline with milestones}
\label{sec:org095a5d8}
\index{manuscript completion!milestones}



\begin{table}[htbp]
\caption[Milestones]{Timeline with milestones.}
\centering
\begin{tabular}{lll}
Milestone & Target date & Achievement date\\[0pt]
\hline
milestone 1 & date & date\\[0pt]
milestone 2 & date & date\\[0pt]
milestone 3 & date & date\\[0pt]
milestone 4 & date & date\\[0pt]
milestone 5 & date & date\\[0pt]
\end{tabular}
\end{table}



\subsection{Assessments of current state}
\label{sec:org3dce00b}
\index{manuscript completion!current state}



\subsubsection{Date:}
\label{sec:org9dd784b}
\index{manuscript completion!by date}



\begin{enumerate}
\item How far is the manuscript from being completed (in percent completion)?
\label{sec:orga37cbe2}
\index{manuscript completion!percent completion}





\item List what keeps the manuscript from being submitted today.
\label{sec:org2619a5b}
\index{manuscript completion!holding back}





\item List what is missing from the manuscript that could improve its impact.
\label{sec:org0ba5cb0}
\index{manuscript completion!what is missing}






\item What could be removed from the manuscript to streamline it?
\label{sec:org24a5c40}
\index{manuscript completion!streamlining}
\end{enumerate}








\section{Daily entries}
\label{sec:org523211b}
\index{daily entries}


\subsection{Daily protocol}
\label{sec:org7813ec5}
\index{daily protocol}


\begin{enumerate}
\item At start of work session, review the timeline
\hyperref[sec:org7fac2d8]{2.5}, recent daily entries
\hyperref[sec:org1ab81e4]{2.2}, next action item \hyperref[sec:org4a1462e]{2.6}, and
to-do list \hyperref[sec:orgef56b58]{2.7}.
\item Write the goal(s) for the current writing session as a means of
engaging mentally in the work. This prose could be retained or
deleted at the end of the work session.
\item At the end of the work session, move finished items to an achievement
list for the day.
\item Move the unfinished items to the to-do list \hyperref[sec:orgef56b58]{2.7}.
\item Identify the next task or action \hyperref[sec:org4a1462e]{2.6}.
\item Update the wordcount.txt file, if you wrote anything
\ref{sec:org47cd6d0}.
\item Update the project Sheet in the Writing Progress Workbook
\hyperref[sec:orgc090fa5]{2.3}.
\item Update your personal knowledge base \hyperref[sec:org47cd6d0]{2.4}.
\end{enumerate}

\subsection{Daily Log}
\label{sec:org1ab81e4}
\index{daily log}



\subsubsection{2024 August 10}
\label{sec:org589db9a}
\index{2024 August 10}

Accomplishments:

\begin{itemize}
\item 

\item 

\item 
\end{itemize}

\subsection{Update Writing Progress Notebook}
\label{sec:orgc090fa5}
\index{writing progress notebook}


\subsection{Update Zettelkästen in org-roam}
\label{sec:org47cd6d0}
\index{zettelkasten}


\subsection{Timeline or Benchmarks}
\label{sec:org7fac2d8}
\index{timeline}
\index{benchmarks}
