writingLogTemplateVer5.org
** Word Count
:PROPERTIES:
:CUSTOM_ID: subsec:wordcount
:END:
#+LaTeX:\index{word count}

# The word count is stored in wordcount.txt. The word count tends to
# approach a plateau in the latter stages of writing.

# The word count tends to approach a plateau in the latter stages of writing.


#+Latex:\begin{figure}[H]
#+LaTeX:  \centering
#+LaTeX:  \begin{tikzpicture}
#+LaTeX:    \begin{axis}[
#+LaTeX:      xlabel={Date},
#+LaTeX:      ylabel={Word Count Cumulative},
#+LaTeX:      % legend pos=south east,
#+LaTeX:      % legend entries={},
#+LaTeX:      ]
#+LaTeX:      \addplot table [x=Day,y=Words] {wordcount.txt};
#+LaTeX:    \end{axis}
#+LaTeX:  \end{tikzpicture}
#+LaTeX:\caption{Cummulative word count.}
#+LaTEX:\end{figure}

#+LaTeX:\begin{table}[]
#+LaTeX:  \centering
#+LaTeX:  \pgfplotstabletypeset[
#+LaTeX:  columns/Date/.style={column name=Date},
#+LaTeX:  columns/Day/.style={column name=Day},
#+LaTeX:  columns/Word/.style={column name=Words},
#+LaTeX:  ]{wordcount.txt}
#+LaTeX:  \caption{Date, day and wordcount.}
#+Latex:  \label{tab:my_label}
#+LaTeX:\end{table}



* Future additions and tangents
:PROPERTIES:
:CUSTOM_ID: subsec:future
:END:
#+LaTeX:\index{future additions and tangents}

# The word count is stored in wordcount.txt. The word count tends to
# approach a plateau in the latter stages of writing.



-
-
-
-
-
-



** Ideas to consider adding to the manuscript
:PROPERTIES:
:CUSTOM_ID: subsec:new-ideas
:END:
#+LaTeX:\index{future additions and tangents}



- 
- 
- 

*** Introduction
:PROPERTIES:
:CUSTOM_ID: ssubsec:new-ideas:Intro
:END:
#+LaTeX:\index{introduction}


-
- 
- 
- 

*** Results
:PROPERTIES:
:CUSTOM_ID: ssubsec:new-ideas:Results
:END:
#+LaTeX:\index{results}


- 
-
- 
- 

*** Discussion
:PROPERTIES:
:CUSTOM_ID: ssubsec:new-ideas:Discussion
:END:
#+LaTeX:\index{discussion}


- 
- 
- 

** To be done someday
:PROPERTIES:
:CUSTOM_ID: subsec:someday
:END:
#+LaTeX:\index{to be done someday}


# This section stores tasks that are related to the current project and
# that may be worth doing someday. Often these tasks are tangential to
# addressing the central hypothesis of the paper. This is a place for
# capturing those wonderful ideas. Sometimes these ideas blossom into new
# projects. This section can capture ideas that might be mentioned in
# terms of future work in the discussion section of the manuscript.

- 
- 
- 

** Spin off writing projects
:PROPERTIES:
:CUSTOM_ID: subsec:spinoffs
:END:
#+LaTeX:\index{spin off writing progect}


-   :: 
-   :: 
-   :: 
-   :: 


* Guidelines, checklists, protocols, helpful hints
:PROPERTIES:
:CUSTOM_ID: sec:guides
:END:
#+LaTeX:\index{guidelines}
#+LaTeX:\index{checkists}
#+LaTeX:\index{protocols}
#+LaTeX:\index{helpful hints}


** Tips for using Overleaf
:PROPERTIES:
:CUSTOM_ID: subsec:guides:overleaf
:END:
#+LaTeX:\index{tips for using Overleaf}

1. Chrome has the TextArea extension that is needed to run Grammarly in
   Overleaf.
2. Use the shortcuts (new commands defined in the preamble) to save time
   typing.
3. Where shortcuts are not possible, use templates.
4. View Overleaf project with Chrome to be able to run Grammarly via the
   Chrome Grammarly extension.
5. code Snippets can be mapped to voice commands in Voice In Plus.



** Protocol for running Grammarly in Overleaf
:PROPERTIES:
:CUSTOM_ID: subsec:guides:grammarlyInoverleaf
:END:
#+LaTeX:\index{running Grammarly in Overleaf}


You must install Grammarly and Textarea extensions for Chrome. With your
project open in Overleaf, open the textarea icon in the upper right of
your browser and check the checkbox. This will convert the PDF viewport
into RichText. Hit the Grammarly icon. Grammarly will check the text in
the RichText viewport. Corrections that you make in the RichText
viewport are applied to your tex file in the left viewport. Note that
the preamble of the document will cause the text to be spread out. You
may have to scroll down a ways to see the document environment.



** Guidelines for debugging the annotated bibliography
:PROPERTIES:
:CUSTOM_ID: subsec:guides:annotDebug
:END:
#+LaTeX:\index{annotated bibliography!guideline for debugging}



For a template annotated bibliography, see
https://github.com/MooersLab/annotatedBibliography.

1. Escape with a forward slash the following: &, _, %, and #.
2. Title case the journal titles.
3. Replace unicode characters with LaTeX code: e.g., replace Å with Å.
   Not all LaTeX document classes are compatible with unicode.
4. The primes have to be replaced with '.
5. The vertical red rectangles with a white dot in the middle should be
   replaced with a whitespace.
6. There are two styles in the bibtex world: bibtex and biblatex. We are
   using bibtex. It is simpler. It has fewer fields.
7. Use Google Scholar bibtex over Medline or PubMed biblatex.
8. Often the error is in the bibitem entry above the one indicated in
   the error messages.
9. All interior braces must by followed by a comma, including the last
   one.
10. When stumped, replace the entry with a fresh one from Google
    Scholar.

    
** Graphical Abstract
:PROPERTIES:
:CUSTOM_ID: subsec:guides:graphicalAbstract
:END:
#+LaTeX:\index{graphical abstract}

The following is copied from the Crystal Journal's
[[https://www.mdpi.com/journal/crystals/instructions#preparation][author
guidelines]].

#+begin_quote
A graphical abstract (GA) is an image that appears alongside the text
abstract in the Table of Contents. In addition to summarizing the
content, it should represent the topic of the article in an interesting
way. The GA should be a high-quality illustration or diagram in any of
the following formats: PNG, JPEG, EPS, SVG, PSD or AI. Written text in a
GA should be clear and easy to read, using one of the following fonts:
Times, Arial, Courier, Helvetica, Ubuntu or Calibri. The minimum size
required for the GA is 560 \(\times\) 1100 pixels (height \(\times\)
width). When submitting larger images, please, keep to the same ratio.
#+end_quote

I usually make the mistake of treating the graphical abstract as an
afterthought. Then there is no time to make one during submission of the
manuscript. This can lead to delays or to the journal converting one of
your sub-figures into a graphical abstract. A good example of a
graphical abstract is found
[[https://www.mdpi.com/2073-4352/11/3/273][here]].


** Guidelines for benchmarks
:PROPERTIES:
:CUSTOM_ID: subsec:guides:benchmarks
:END:
#+LaTeX:\index{guidelines for benchmarks}


** Guidelines for using Writing Progress Notebook
:PROPERTIES:
:CUSTOM_ID: subsec:guides:wpnb
:END:
#+LaTeX:\index{writing progress notebook!guidelines}

The writing progress notebook enables the tracking of progress on a
project basis [fn:3]. The Notebook automatically updates sums of words
written and minutes spent across all projects on a given day. It only
takes a few seconds to enter the number of words written and the time
spent for a specific project on that project's Google Sheet. If you have
Voice In plus activated, say the words "open sheet 37" to have the
worksheet for project 37 opened in the web browser. If not, click on
this direct link to the Google Sheet in the compiled PDF of this writing
log [fn:4].


