writingLogTemplateVer5.tex


\subsection{Next action}
\label{sec:org4a1462e}
\index{next action}


\subsection{To be done}
\label{sec:orgef56b58}
\index{To be done}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}

\subsection{Word Count}
\label{sec:orgbb91ebf}
\index{word count}


\begin{figure}[H]
\centering
\begin{tikzpicture}
\begin{axis}[
xlabel={Date},
ylabel={Word Count Cumulative},
% legend pos=south east,
% legend entries={},
]
\addplot table [x=Day,y=Words] {wordcount.txt};
\end{axis}
\end{tikzpicture}
\caption{Cummulative word count.}
\end{figure}

\begin{table}[]
\centering
\pgfplotstabletypeset[
columns/Date/.style={column name=Date},
columns/Day/.style={column name=Day},
columns/Word/.style={column name=Words},
]{wordcount.txt}
\caption{Date, day and wordcount.}
\label{tab:my_label}
\end{table}



\section{Future additions and tangents}
\label{sec:orgea47b17}
\index{future additions and tangents}



\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}



\subsection{Ideas to consider adding to the manuscript}
\label{sec:org41166df}
\index{future additions and tangents}



\begin{itemize}
\item 

\item 

\item 
\end{itemize}

\subsubsection{Introduction}
\label{sec:orgc1aaa24}
\index{introduction}


\begin{itemize}
\item 

\item 

\item 

\item 
\end{itemize}

\subsubsection{Results}
\label{sec:orgb264f0d}
\index{results}


\begin{itemize}
\item 

\item 

\item 

\item 
\end{itemize}

\subsubsection{Discussion}
\label{sec:org39c8298}
\index{discussion}


\begin{itemize}
\item 

\item 

\item 
\end{itemize}

\subsection{To be done someday}
\label{sec:org73f9ca1}
\index{to be done someday}


\begin{itemize}
\item 

\item 

\item 
\end{itemize}

\subsection{Spin off writing projects}
\label{sec:org7bfe879}
\index{spin off writing progect}


\begin{itemize}
\item ::
\item ::
\item ::
\item ::
\end{itemize}


\section{Guidelines, checklists, protocols, helpful hints}
\label{sec:org0bb785d}
\index{guidelines}
\index{checkists}
\index{protocols}
\index{helpful hints}


\subsection{Tips for using Overleaf}
\label{sec:orgfe2d630}
\index{tips for using Overleaf}

\begin{enumerate}
\item Chrome has the TextArea extension that is needed to run Grammarly in
Overleaf.
\item Use the shortcuts (new commands defined in the preamble) to save time
typing.
\item Where shortcuts are not possible, use templates.
\item View Overleaf project with Chrome to be able to run Grammarly via the
Chrome Grammarly extension.
\item code Snippets can be mapped to voice commands in Voice In Plus.
\end{enumerate}



\subsection{Protocol for running Grammarly in Overleaf}
\label{sec:org5512821}
\index{running Grammarly in Overleaf}


You must install Grammarly and Textarea extensions for Chrome. With your
project open in Overleaf, open the textarea icon in the upper right of
your browser and check the checkbox. This will convert the PDF viewport
into RichText. Hit the Grammarly icon. Grammarly will check the text in
the RichText viewport. Corrections that you make in the RichText
viewport are applied to your tex file in the left viewport. Note that
the preamble of the document will cause the text to be spread out. You
may have to scroll down a ways to see the document environment.



\subsection{Guidelines for debugging the annotated bibliography}
\label{sec:org33da1bd}
\index{annotated bibliography!guideline for debugging}



For a template annotated bibliography, see
\url{https://github.com/MooersLab/annotatedBibliography}.

\begin{enumerate}
\item Escape with a forward slash the following: \&, \_, \%, and \#.
\item Title case the journal titles.
\item Replace unicode characters with \LaTeX{} code: e.g., replace Å with Å.
Not all \LaTeX{} document classes are compatible with unicode.
\item The primes have to be replaced with '.
\item The vertical red rectangles with a white dot in the middle should be
replaced with a whitespace.
\item There are two styles in the bibtex world: bibtex and biblatex. We are
using bibtex. It is simpler. It has fewer fields.
\item Use Google Scholar bibtex over Medline or PubMed biblatex.
\item Often the error is in the bibitem entry above the one indicated in
the error messages.
\item All interior braces must by followed by a comma, including the last
one.
\item When stumped, replace the entry with a fresh one from Google
Scholar.
\end{enumerate}


\subsection{Graphical Abstract}
\label{sec:org69785a2}
\index{graphical abstract}

The following is copied from the Crystal Journal's
\href{https://www.mdpi.com/journal/crystals/instructions\#preparation}{author
guidelines}.

\begin{quote}
A graphical abstract (GA) is an image that appears alongside the text
abstract in the Table of Contents. In addition to summarizing the
content, it should represent the topic of the article in an interesting
way. The GA should be a high-quality illustration or diagram in any of
the following formats: PNG, JPEG, EPS, SVG, PSD or AI. Written text in a
GA should be clear and easy to read, using one of the following fonts:
Times, Arial, Courier, Helvetica, Ubuntu or Calibri. The minimum size
required for the GA is 560 \(\times\) 1100 pixels (height \(\times\)
width). When submitting larger images, please, keep to the same ratio.
\end{quote}

I usually make the mistake of treating the graphical abstract as an
afterthought. Then there is no time to make one during submission of the
manuscript. This can lead to delays or to the journal converting one of
your sub-figures into a graphical abstract. A good example of a
graphical abstract is found
\href{https://www.mdpi.com/2073-4352/11/3/273}{here}.


\subsection{Guidelines for benchmarks}
\label{sec:org338b36d}
\index{guidelines for benchmarks}


\subsection{Guidelines for using Writing Progress Notebook}
\label{sec:orgac44e40}
\index{writing progress notebook!guidelines}

The writing progress notebook enables the tracking of progress on a
project basis \footnote{\url{https://github.com/MooersLab/writing-progress-2024-25}}. The Notebook automatically updates sums of words
written and minutes spent across all projects on a given day. It only
takes a few seconds to enter the number of words written and the time
spent for a specific project on that project's Google Sheet. If you have
Voice In plus activated, say the words "open sheet 37" to have the
worksheet for project 37 opened in the web browser. If not, click on
this direct link to the Google Sheet in the compiled PDF of this writing
log \footnote{\href{<insert link for specific sheet>}{<insert link for specific sheet>}}.
