writingLogTemplateVer5.org
** Guidelines for using a personal knowledge base
:PROPERTIES:
:CUSTOM_ID: subsec:guides:knowledgebase
:END:
#+LaTeX:\index{personal knowledge base!guidelines}

If you maintain a knowledge base like a Zettelkästen in org-roam or
Obsidian or Notion, you might consider adding literature notes and
permanent notes at the end of a work session [fn:5] [fn:6]. The name of
the index for this project is =XXXXXXXXX=. Enter =Control-c n f= to find
this project note. This knowledge base can store information that you
may want to use eventually in the paper.

These notes that you may add might be in the form of what are called
*permanent notes* that include new insights or plans for the work. These
thoughts are not directly linked or derived from any particular
reference in the literature. Another kind of note is known as a
*citation note* or *literature note* is derived from a specific
reference. This kind of note will contain the BibTeX cite key.

Although such notes can be stored in an annotated bibliography
(https://github.com/MooersLab/annotatedBibliography), I seem less likely
to utilize this information while working on a manuscript because the
annotated bibliographies are in a different document. Because it is out
of sight, the annotated bibliography is also out of mind.

The advantage of keeping these bits of knowledge inside the writing log
is that you can link the entries made in the daily log section to these
bits of knowledge by using the label and ref macros of LaTeX. You can
also set up label and ref pairs between to-do items and the bits of
knowledge. Some of these notes may refer to a particular reference, so
you can include the cite key with these notes if the reference has been
included in the BibTeX library file sourced at the bottom of this file.

I usually source the BibTeX library file that I am using in the
annotated bibliography for a particular project. Keeping these items
together in one document will improve the odds that you act upon the
collected information, reducing the mental bandwidth you have to commit
to managing this writing log.

Another approach I use sometimes is to include such information on lines
that have been commented out in the manuscript's tex document near where
I want to utilize that information. I must admit that this approach can
become a little unwieldy if the comments span many lines.

If you use the Pomodoro method, you would probably want to commit the
last one or two poms of a work session on a writing project to update
your knowledge base. If you have been lagging on doing such updates, you
may want to commit four to six poms to this kind of work; you might have
to do this over multiple days if you have fallen behind.




** Writer's Creed
:PROPERTIES:
:CUSTOM_ID: subsec:guides:writerscreed
:END:
#+LaTeX:\index{writer's creed}

A writer does the following:


- Schedules daily writing time on workdays; takes a relaxed approach on weekends.
- Shows up and writes during the scheduled writing time.
- Stands up and walks around every 25 minutes for no more than 5 minutes (i.e., uses the Pomodoro technique).
- Limits generative writing to 3-5 hours daily; spends the rest of the day on supportive tasks and other duties.
- Overcomes writer's block by rewriting the last paragraph or reverse outlining a section.
- Keeps near a list of tricks for overcoming writer's block.
- Manages their energy by doing generative writing first, rewriting second, and supportive tasks later in the day.
- Jumps into generative writing; does not wait to be inspired.
- Does generative writing when half-awake early in the day and editing and rewriting when fully alert, generally mid to late morning.
- Masters their writing tools without letting the tools master them.
- Writes without distractions (no YouTube videos, TV, radio, etc.; playing classical music is okay sometimes).
- Tracks the time spent and words written by project ID.
- Takes credit for time spent reading material related to the project, especially if finished by making an entry in an annotated bibliography.
- Uses a separate writing log for each writing project.
- Makes writing social when it is mutually beneficial.
- Reads and writes about writing at least once a fortnight.
- Keeps up on weasel words,  wordy phrases, cliché, and other junk English; reviews this list quarterly to avoid their use.
- If a scientist, writes with precision, clarity, and conciseness. The order is in descending importance. Has memorized this list.
- Uses computerized writing tools responsibly, not blindly: Takes full responsibility for the final draft.
- Documents in writing log any use of AI to generate or paraphrase passages.
- Uses dictation software for some generative writing.
- Uses software tools like *Grammarly*, the *LanguageTool*, and the *Hemingway.app* to stimulate improvements in their writing.
- Knows enough about good writing to accept only useful suggestions.
- Does not blindly accept noun clusters, English contractions, and weasel words suggested by AI software.
- Uses copilot when exhausted to complete sentences.
- Uses the paraphrasing tool of some chatbots (e.g. TexGPT) cautiously and only to generate intermediate drafts.
- Reviews this list periodically.

Premises of the creed:

- Writing is any activity that advances a writing project. Most of the time spent on these writing activities does not involve generative writing.
- Generative writing is the most valuable activity: All other activities descend from it.
- Generative writing and editing use different parts of the brain, so they should be done at separate times.
- Generative writing is best done when half awake because your internal editor is not fully on so new ideas are more likely to emerge.
- Generative writing be done by dictation while commuting if planned before the commute.
- Editing is best done when fully awake because your internal editor will be activated. (Be careful; late-night editing can keep you awake later than intended and interfere with your sleep pattern.)
- Most of the time spent on actual *writing* involves rewriting.
- Planning is an important (underemphasized) component of writing.
- Writing includes any activity that advances a writing project.
- The word count does not capture most writing-related activities. Hence, the time spent on these activities must be tracked to document these efforts.
- Time tracking is an essential component of time management. It is hard to manage what you do not measure. **Writing involves a lot of time management!!**
- 90 minutes of generative writing per day on one project is the optimal length of time due to our [ultradian cycles](https://www.youtube.com/watch?v=ezT8kGzYOng). Thank you to my brother, Randall, for alerting me to this. Longer stretches of writing on one project are known as *binge writing*, which always leads to diminishing returns.
- Writing includes reading the papers that you cite and those that you do not wind up citing. This reading activity can rejuvenate your momentum and inspire new ideas. It is best done in the evening so your subconscious can work overnight with the new insights. **Writing involves feeding your subconscious: Feed our head!**. Reading is grossly underemphasized in writing books. Time should be scheduled for it else it is less likely to be done.
- Writing includes mundane tasks like managing bibliographic libraries and making figures; these are good afternoon activities.
- Writing includes data analysis.



* Backmatter
:PROPERTIES:
:CUSTOM_ID: backmatter
:END:


#+Latex:\bibliography{AnnoBibMyBDA}
#+LaTeX:\printindex

[fn:1] [[https://github.com/MooersLab/writing-progress-2024-25]]

[fn:2] [[file:<insert link for specific sheet>][<insert link for specific sheet>]]

[fn:3] [[https://github.com/MooersLab/writing-progress-2024-25]]

[fn:4] [[file:<insert link for specific sheet>][<insert link for specific sheet>]]

[fn:5] [[https://wiki2.org/en/Zettelkasten]]

[fn:6] [[https://wiki2.org/en/Comparison_of_note-taking_software]]
