writingLogTemplateVer5.tex


\subsection{Guidelines for using a personal knowledge base}
\label{sec:org804adf1}
\index{personal knowledge base!guidelines}

If you maintain a knowledge base like a Zettelkästen in org-roam or
Obsidian or Notion, you might consider adding literature notes and
permanent notes at the end of a work session \footnote{\url{https://wiki2.org/en/Zettelkasten}} \textsuperscript{,}\,\footnote{\url{https://wiki2.org/en/Comparison\_of\_note-taking\_software}}. The name of
the index for this project is \texttt{XXXXXXXXX}. Enter \texttt{Control-c n f} to find
this project note. This knowledge base can store information that you
may want to use eventually in the paper.

These notes that you may add might be in the form of what are called
\textbf{permanent notes} that include new insights or plans for the work. These
thoughts are not directly linked or derived from any particular
reference in the literature. Another kind of note is known as a
\textbf{citation note} or \textbf{literature note} is derived from a specific
reference. This kind of note will contain the BibTeX cite key.

Although such notes can be stored in an annotated bibliography
(\url{https://github.com/MooersLab/annotatedBibliography}), I seem less likely
to utilize this information while working on a manuscript because the
annotated bibliographies are in a different document. Because it is out
of sight, the annotated bibliography is also out of mind.

The advantage of keeping these bits of knowledge inside the writing log
is that you can link the entries made in the daily log section to these
bits of knowledge by using the label and ref macros of \LaTeX{}. You can
also set up label and ref pairs between to-do items and the bits of
knowledge. Some of these notes may refer to a particular reference, so
you can include the cite key with these notes if the reference has been
included in the BibTeX library file sourced at the bottom of this file.

I usually source the BibTeX library file that I am using in the
annotated bibliography for a particular project. Keeping these items
together in one document will improve the odds that you act upon the
collected information, reducing the mental bandwidth you have to commit
to managing this writing log.

Another approach I use sometimes is to include such information on lines
that have been commented out in the manuscript's tex document near where
I want to utilize that information. I must admit that this approach can
become a little unwieldy if the comments span many lines.

If you use the Pomodoro method, you would probably want to commit the
last one or two poms of a work session on a writing project to update
your knowledge base. If you have been lagging on doing such updates, you
may want to commit four to six poms to this kind of work; you might have
to do this over multiple days if you have fallen behind.




\subsection{Writer's Creed}
\label{sec:orga5fafd6}
\index{writer's creed}

A writer does the following:


\begin{itemize}
\item Schedules daily writing time on workdays; takes a relaxed approach on weekends.
\item Shows up and writes during the scheduled writing time.
\item Stands up and walks around every 25 minutes for no more than 5 minutes (i.e., uses the Pomodoro technique).
\item Limits generative writing to 3-5 hours daily; spends the rest of the day on supportive tasks and other duties.
\item Overcomes writer's block by rewriting the last paragraph or reverse outlining a section.
\item Keeps near a list of tricks for overcoming writer's block.
\item Manages their energy by doing generative writing first, rewriting second, and supportive tasks later in the day.
\item Jumps into generative writing; does not wait to be inspired.
\item Does generative writing when half-awake early in the day and editing and rewriting when fully alert, generally mid to late morning.
\item Masters their writing tools without letting the tools master them.
\item Writes without distractions (no YouTube videos, TV, radio, etc.; playing classical music is okay sometimes).
\item Tracks the time spent and words written by project ID.
\item Takes credit for time spent reading material related to the project, especially if finished by making an entry in an annotated bibliography.
\item Uses a separate writing log for each writing project.
\item Makes writing social when it is mutually beneficial.
\item Reads and writes about writing at least once a fortnight.
\item Keeps up on weasel words,  wordy phrases, cliché, and other junk English; reviews this list quarterly to avoid their use.
\item If a scientist, writes with precision, clarity, and conciseness. The order is in descending importance. Has memorized this list.
\item Uses computerized writing tools responsibly, not blindly: Takes full responsibility for the final draft.
\item Documents in writing log any use of AI to generate or paraphrase passages.
\item Uses dictation software for some generative writing.
\item Uses software tools like \textbf{Grammarly}, the \textbf{LanguageTool}, and the \textbf{Hemingway.app} to stimulate improvements in their writing.
\item Knows enough about good writing to accept only useful suggestions.
\item Does not blindly accept noun clusters, English contractions, and weasel words suggested by AI software.
\item Uses copilot when exhausted to complete sentences.
\item Uses the paraphrasing tool of some chatbots (e.g. TexGPT) cautiously and only to generate intermediate drafts.
\item Reviews this list periodically.
\end{itemize}

Premises of the creed:

\begin{itemize}
\item Writing is any activity that advances a writing project. Most of the time spent on these writing activities does not involve generative writing.
\item Generative writing is the most valuable activity: All other activities descend from it.
\item Generative writing and editing use different parts of the brain, so they should be done at separate times.
\item Generative writing is best done when half awake because your internal editor is not fully on so new ideas are more likely to emerge.
\item Generative writing be done by dictation while commuting if planned before the commute.
\item Editing is best done when fully awake because your internal editor will be activated. (Be careful; late-night editing can keep you awake later than intended and interfere with your sleep pattern.)
\item Most of the time spent on actual \textbf{writing} involves rewriting.
\item Planning is an important (underemphasized) component of writing.
\item Writing includes any activity that advances a writing project.
\item The word count does not capture most writing-related activities. Hence, the time spent on these activities must be tracked to document these efforts.
\item Time tracking is an essential component of time management. It is hard to manage what you do not measure. \textbf{\textbf{Writing involves a lot of time management!!}}
\item 90 minutes of generative writing per day on one project is the optimal length of time due to our [ultradian cycles](\url{https://www.youtube.com/watch?v=ezT8kGzYOng}). Thank you to my brother, Randall, for alerting me to this. Longer stretches of writing on one project are known as \textbf{binge writing}, which always leads to diminishing returns.
\item Writing includes reading the papers that you cite and those that you do not wind up citing. This reading activity can rejuvenate your momentum and inspire new ideas. It is best done in the evening so your subconscious can work overnight with the new insights. \textbf{\textbf{Writing involves feeding your subconscious: Feed our head!}}. Reading is grossly underemphasized in writing books. Time should be scheduled for it else it is less likely to be done.
\item Writing includes mundane tasks like managing bibliographic libraries and making figures; these are good afternoon activities.
\item Writing includes data analysis.
\end{itemize}



\section{Backmatter}
\label{sec:org3ac1ef5}
\bibliography{AnnoBibMyBDA}
\printindex
\end{document}
